Repository: maratych/ZhRuParCor_pipeline
Catalog: compare/data/sb_en-et.tmx
Source language: en
Languages: et

source: For loans that have been identified as impaired as well as portfolios of loans with similar credit terms affected by a loss event, assumptions are made as to when in the future the cash flows will be received as well as their size.
et: Allahinnatud mitteteenivate laenude (ingl. k. impaired loans) ja kahjujuhtumi poolt mõjutatud sarnaste tingimustega laenuportfelli kohta tehakse oletusi, millal ja millises suuruses laekub nendega seotud rahavoog.

source: Provisions for loan losses are made for the difference between the present value of these projected cash flows and the claims’ carrying amount.
et: Provisjonide aluseks on erinevus projekteeritud tulevikurahavoogude ja bilansilise jääkmaksumuse vahel.

source: Decisions are therefore based on various estimates and management’s judgments about current market conditions.
et: Otsused provisjonide kohta baseeruvad seetõttu erinevatel arvutustel ja juhtkonna hinnangutel hetke turutingimustele.

source: Portfolio provisions are based on loss estimates made in accordance with capital adequacy rules.
et: Portfellipõhised allhindlused põhinevad kapitali adekvaatsuse arvutustes leitud oodataval kahjul.

source: Note 3 Capital adequacy
et: Lisa 3 Kapitali adekvaatsus

source: Swedbank uses IRB (Internal ratings based) method to calculate capital requirement for credit risk and standardized method for market and operational risks.
et: Swedbank kasutab kapitalinõude arvutamisel sisereitingute meetodit krediidiriski ja standardmeetodit turu- ja operatsiooniriskide arvutamisel.

source: Companies included in capital adequacy calculation
et: Kapitali adekvaatsuse arvutamisse kaasatud Swedbank AS konsolideerimisgrupi ettevõtted

source: Swedbank AS
et: Swedbank AS (Eesti)

source: The Swedbank insurance companies are not included according to the Basel 2 capital adequacy rules.
et: * Krediidiasutuste usaldusnormatiivide arvutamise eeskirja Basel II kohaselt ei ole grupi kindlustusseltse kaasatud.

source: Capital base
et: Omavahendid

source: The capital base serves as a buffer against the losses that can arise from risks to which Swedbank is exposed.
et: Omavahendid on puhvriks kahjude puhul, mis võivad tekkida Swedbanki poolt võetud riskide tõttu.

source: Bank’s ability to sustain large losses is also to a large extent dependent on the strength of the income statement but also on more qualitative factors such as risk management capabilities and internal governance and control.
et: Swedbanki võime kanda suuri kahjusid sõltub suures osas kasumiaruande tugevusest, ent ka kvalitatiivsematest teguritest nagu riskijuhtimisvõimekus ning sisejuhtimine ja -kontroll.

source: Capital requirement for credit risks
et: Krediidiriskide kapitalinõuded

source: Credit risk refers to the risk that a counterpart is incapable of meeting its obligations and pledged assets do not cover the claims.
et: Krediidirisk väljendab ohtu, et vastaspool ei suuda oma kohustusi täita ja lepingu tagatiseks olevatest varadest ei piisa nõuete rahuldamiseks.

source: Credit risk includes concentration risk that includes large individual exposures as well as significant exposures to groups of counterparts whose likelihood of default is driven by common underlying factors, such as the economy, sector, geography, instrument type or other.
et: Krediidiriski alla kuulub ka kontsentratsioonirisk, mille puhul ähvardab riski keskmesse sattumine kas üksikisikuid või vastaspoolte rühmi, kelle lepingurikkumise tõenäosus on seotud selliste üldiste teguritega nagu majanduse või tööstusharu olukord, geograafiline asend, finantsinstrumendi liik vms.

source: Credit risk forms the largest part of the total outstanding risk for Swedbank and is inherent in almost all regular credit products such as loans, leasing, credit cards, guarantees and derivatives.
et: Krediidirisk moodustab suurima osa Swedbanki koguriskist ja see kaasneb peaaegu kõigi tavapäraste krediiditoodetega – laenude, liisingu, krediitkaartide, garantiide ja tuletisinstrumentidega.

source: Market risks
et: Tururiskid

source: Exposure to market risks arises from positions that are affected by changes in market risk factors: interest rates, foreign exchange rates and equity prices (or other relevant risk factors such as implicit volatility for options).
et: Tururiskid tulenevad positsioonidest, mida mõjutavad omakorda muutused tururiski tegurites, nt intressimäärades, valuutakurssides ja aktsiahindades (või muud riskitegurid nagu optsioonide kaudne volatiilsus).

source: For capital requirement calculation purposes, the standardized approach has been implemented under Basel 2 capital adequacy rules.
et: Tururiski kapitalinõuete arvutamiseks on krediidiasutuste usaldusnormatiivide arvutamise eeskirja Basel II raames võetud kasutusele standardmeetod.

source: Operational risks
et: Operatsioonirisk

source: Operational risk stands for any undesirable impact to business objectives, including direct or indirect financial loss or loss of confidence, occurring in day-to-day business operation, resulting from errors or omissions in internal procedures or systems, or due to human errors or fraud, or from external events.
et: Operatsioonirisk tähendab ärieesmärkidele avalduvat negatiivset mõju, sh otsest või kaudset finantskahju või usalduse kaotust. Operatsioonirisk tekib igapäevase majandustegevuse käigus, tuleneb sisemiste protseduuride või süsteemide vigadest või tõrgetest, inimlikest eksimustest, pettusest või välistest sündmustest.

source: For defining capital requirement to cover unexpected losses from operational risk, Swedbank has implemented the standardized approach under Basel 2 capital adequacy rules in Estonia.
et: Operatsiooniriskist tingitud ootamatute kahjude kandmiseks vajalike kapitalinõuete arvutamiseks on Swedbank Eestis rakendanud krediidiasutuste usaldusnormatiivide arvutamise eeskirja Basel II standardmeetodit.

source: The required methods have been implemented, such as loss database, risk self-assessment and business contingency planning.
et: Swedbank on kasutusele võtnud nõutavad meetodid, mille hulka kuuluvad kahjude andmebaas, riskidega seotud enesehinnang ja talituspidevuse planeerimine.

source: Changes in 2014
et: Muutused 2014. aasta aruannetes

source: There are some changes in capital adequacy reporting from 2014 as a result of regulatory changes in the framework of Basel III.
et: Seoses Baseli III raamistikus sätestatud regulatiivsete nõuete muutusega on alates 2014. aastast muutunud kapitali adekvaatsuse raporteerimine.

source: Reporting as of 31 March 2014 is according to current regulations (Basel III).
et: 2014. aasta näitajad on kajastatud kehtivatele nõuetele kohaselt (Basel III).

source: Comparative figures as of 2013 are according to previous regulation (Basel II).
et: 2013. aasta vastavad näitajad on kajastatud sel perioodil kehtinud nõuete kohaselt (Basel II).

source: It is not required to use transitional minimum capital level in capital adequacy calculation starting from 2014.
et: Alates 2014. aastast ei ole nõutav üleminekuperioodi miinumumomavahendite kasutamine kapitali adekvaatsuse määra arvutamisel.

source: As a result capital adequacy ratios increase by more than 1.2 times.
et: See suurendab Swedbanki kapitali adekvaatsuse määra rohkem kui 1,2 korda.

source: There are more changes in the regulations but the effect to capital adequacy ratio is minor.
et: Teiste regulatiivsete nõuete muutuse mõju kapitali adekvaatsuse määrale oli ebaoluline.

source: In addition, increased retained earnings supported the ratio increase in the first quarter.
et: Täiendavalt suurenes 2014. aasta esimese kvartali kapitali adekvaatsuse määr eelmise aasta jaotamata kasumi summa lisandumise tõttu.

source: In total the capital adequacy ratio increased to 42.8 per cent in the first quarter 2014 compared with 27.4 per cent in the fourth quarter 2013.
et: Kokkuvõttes suurenes kapitali adekvaatsuse määr 2014. aasta esimese kvartali lõpus 42,8%-ni võrreldes 27,4%-ga 2013. aasta lõpus.

source: Primary capital (Tier 1)
et: Esmased omavahendid (Tier 1)

source: Share capital
et: Aktsiakapital

source: Share premium
et: Aktsiakapital

source: Reserves
et: Reservid

source: Retained earnings from previous periods
et: Eelmiste perioodide jaotamata kasum

source: Less: Intangible assets
et: Immateriaalne vara (negatiivne väärtus)

source: Total Tier 1
et: Esmased omavahendid (Tier 1) kokku

source: Supplementary capital (Tier 2)
et: Täiendavad omavahendid (Tier 2)

source: Subordinated debt
et: Allutatud laen

source: Value adjustments and provisions exceeding the expected loss
et: Oodatavat kahju ületavad allahindlused ja korrigeerimised

source: Own funds, total
et: Brutoomavahendid kokku

source: Deductions from own funds
et: Mahaarvamised omavahenditest

source: Own funds, net
et: Netoomavahendid kokku

source: Capital requirements and risk exposure
et: Kapitalinõuded ja riskiga kaalutud varad

source: Capital requirement for credit risks, standardized approach
et: Krediidiriskide kapitalinõuded, standardmeetod

source: Total capital requirement for credit risks, standardized approach
et: Krediidiriskide kapitalinõuded, standardmeetod

source: Capital requirement for credit risks, internal ratings based approach
et: Krediidiriskide kapitalinõuded, sisereitingute meetod

source: Credit institutions and investment firms
et: Krediidiasutused ja investeerimisühingud

source: Other companies
et: Muud äriühingud

source: Other items
et: Muud varad

source: Retail exposures
et: Jaenõuded

source: Total capital requirement for credit risk
et: Krediidiriski kapitalinõuded kokku

source: Capital requirement for market risks
et: Tururiskide kapitalinõuded

source: Foreign exchange risk
et: Valuutariski kapitalinõuded

source: Interest rate risk
et: Intressipositsiooniriski kapitalinõuded

source: Equity position
et: Aktsiapositsiooniriski kapitalinõuded

source: Total capital requirement for market risk
et: Tururiskide kapitalinõuded kokku

source: Capital requirement for operational risks
et: Operatsiooniriski kapitalinõuded

source: Capital requirement for operational risk, standardized approach
et: Operatsiooniriski standardmeetod

source: Total capital requirement for operational risk
et: Operatsiooniriski kapitalinõuded kokku

source: Credit value adjustment (CVA)
et: CVA

source: Total capital requirement
et: Kapitalinõuded kokku

source: Transitional minimum of own funds
et: Üleminekuperioodi omavahendite miinimum

source: Total capital requirement, transition rules
et: Üleminekuperioodi kapitalinõuded kokku

source: Risk exposure
et: Riskiga kaalutud varad

source: Risk exposure amount credit risks
et: Krediidiriskide riskiga kaalutud varad

source: Risk exposure amount market risks
et: Tururiskide riskiga kaalutud varad

source: Risk exposure amount operational risks
et: Operatsiooniriski riskiga kaalutud varad

source: Risk exposure amount credit value adjustment
et: CVA

source: Total risk exposure amount
et: Riskiga kaalutud varad kokku

source: Transitional minimum for adequacy calculation
et: Üleminekuperioodi miinimum adekvaatsuse arvutamiseks

source: Total risk exposure amount for adequacy calculation
et: Riskiga kaalutud varad kokku adekvaatsuse arvutamiseks

source: Capital ratios
et: Kapitali suhtarvud

source: Tier 1 capital ratio, %*
et: Tier 1 suhtarv, %*

source: Tier 2 capital ratio, %**
et: Tier 2 suhtarv, %**

source: Total capital adequacy ratio, %
et: Kogukapitali adekvaatsuse suhtarv, %

source: Tier 1 capital divided by total risk-weighted on and off balance sheet items
et: Esmased omavahendid jagatud riskiga kaalutud bilansiliste ja bilansiväliste kirjetega

source: ** Tier 2 capital divided by total risk-weighted on and off balance sheet items
et: ** Täiendavad omavahendid jagatud riskiga kaalutud bilansiliste ja bilansiväliste kirjetega

source: General information of Swedbank AS, Estonia
et: Üldinformatsioon

source: Company name
et: Ettevõtte nimi

source: Address
et: Aadress

source: Registered in
et: Registreerinud riik

source: Registry code
et: Äriregistrikood

source: Phone
et: Telefon

source: Fax
et: Faks

source: E-mail
et: E-post

source: Homepage
et: Kodulehekülg

source: Auditor
et: Audiitor

source: Reporting date
et: Bilansikuupäev

source: Reporting period
et: Aruandlusperiood

source: Reporting currency
et: Aruandlusvaluuta

source: Liivalaia 8, Tallinn 15040, Estonia
et: Liivalaia 8, Tallinn 15040, Eesti

source: Republic of Estonia
et: Eesti Vabariik

source: 10060701 (Estonian Commercial Register)
et: 10060701 (Eesti Äriregister)

source: 31 March 2014
et: 31. märts 2014

source: 1 January 2014 - 31 March 2014
et: 1. jaanuar 2014 – 31. märts 2014
